##### Question 1. Write a Python code to determine if two strings are isomorphic.
##### To be isomorphic, each character in the first string must uniquely map to a character in the second string, and vice versa.

In [5]:
def is_isomorphic(string1, string2):
    if len(string1) == len(string2):
        map_s1_to_s2 = {}
        map_s2_to_s1 = {}
    
        is_isomorphic = True
    
        for s1 , s2 in zip(string1, string2):
            if s1 in map_s1_to_s2:
                if map_s1_to_s2[s1] != s2:
                    is_isomorphic = False
                    break
            else:
                map_s1_to_s2[s1] = s2
                
            if s2 in map_s2_to_s1:
                if map_s2_to_s1[s2] != s1:
                    is_isomorphic = False
                    break
            else:
                map_s2_to_s1[s2] = s1
    
        if is_isomorphic == False:
            print("Non-Isomorphic")
        else:
            print("Isomorphic")
    else:
        print("Non-Isomorphic")
            
is_isomorphic('eggs', 'add')

Non-Isomorphic

##### list1 = [4,7,8,1,3,2,7,7,9]
##### Question 2. write a python code to get it sorted in the ascending order without using pre-defined functions ?

In [49]:
list1 = [9,7,8,1,35,2,7,7,9]
# we can approach this problem by using Bubble sort
n = len(list1)
# Run a loop on all elements of the list
for i in range(n):
    # Run a loop on all the elements except for last element which is already sorted
    for j in range(0,n-i-1):
        if list1[j] > list1[j+1]:
            # swap the elemets if the element is greater than the next element
            list1[j],list1[j+1] = list1[j+1],list1[j]
        else:
            continue
        
print(list1)

[1, 2, 7, 7, 7, 8, 9, 9, 35]

In [60]:
list1 = [4, 7, 8, 1, 3, 2, 7, 7, 9]

# Let's approach this problem by selection sort

# Initialize the minimum index to be that of first element
for i in range(n):
    min_index = i

    for j in range(i+1,len(list1)):
        if list1[j] < list1[min_index]:
            min_index = j
    list1[i],list1[min_index] = list1[min_index],list1[i]
    
    
print(list1)

[1, 2, 3, 4, 7, 7, 7, 8, 9]

#### Question3 Write a query to find the total sales for each department and identify the highest-selling department from the following data:

In [10]:
# Sample data for Dept Table
dept_data = [(1, 'A', 'XYZ'),
             (2, 'B', 'ABC'),
             (3, 'C', 'DEF'),
             (4, 'D', 'HIJ')]

# Sample data for Sales Table
sales_data = [('1A', 2, 300),
              ('2A', 3, 400),
              ('3B', 3, 200),
              ('4A', 4, 500)]

In [9]:
import pandas as pd

dept_df = pd.DataFrame(dept_data, columns=["ID", "Name", "Desc"])
sales_df = pd.DataFrame(sales_data, columns=["Trans_ID", "Dept", "Amount"])

total_sales_df = sales_df.groupby("Dept")["Amount"].sum().reset_index()

result_df = pd.merge(total_sales_df, dept_df, left_on="Dept", right_on="ID")

max_sales_df = result_df[result_df["Amount"] == result_df["Amount"].max()]

final_result_df = max_sales_df[["Dept", "Name", "Desc", "Amount"]]

print(final_result_df)

   Dept Name Desc  Amount
1     3    C  DEF     600

#### Question Write a query to calculate the number of distinct mobile numbers for each username from the following input:
#### input
#### username, mobile
#### user1,999999991:888888882
#### user3,777777771
#### user2,777777234:823232351
#### user5,734452343:943433434:834323434
#### user1,999999991:9994433777

#### output
#### username mobile_count
#### user1 3
#### user2 2
#### user3 1

Using SQL

WITH NO_MOBILE AS(

    SELECT username, mobile,

    GENERATE_SERIES(1,length(mobile)-length(REPLACE(mobile,:,'')))+1) as n

    FROM input_tab),

    mobile_no AS(

        SELECT, username, SPLIT_VALUE(mobile,':',n) as number

        FROM NO_MOBILE)

    Mobile AS(

        SELECT username, TRIM(number) as mobile

        FROM mobile_no
    )

SELECT m.username, distinct count(m.mobile) as mobile_count

FROM Mobile m

on i.username = m.username

group by m.username

order by m.username

In [29]:
import pandas as pd

data = {
    'username' : ['user1','user3','user2','user5','user1'],
    'mobile'   :['999999991:888888882', '777777771', '777777234:823232351', '734452343:943433434:834323434', '999999991:9994433777']}

dataframe = pd.DataFrame(data)
dataframe

  username                         mobile
0    user1            999999991:888888882
1    user3                      777777771
2    user2            777777234:823232351
3    user5  734452343:943433434:834323434
4    user1           999999991:9994433777

In [30]:
expanded_row = []

for index, row in dataframe.iterrows():
    mobiles = row['mobile'].split(':')
    for no in mobiles:
        expanded_row.append((row['username'],no.strip()))
df = pd.DataFrame(expanded_row, columns=['username','mobile'])
df

  username      mobile
0    user1   999999991
1    user1   888888882
2    user3   777777771
3    user2   777777234
4    user2   823232351
5    user5   734452343
6    user5   943433434
7    user5   834323434
8    user1   999999991
9    user1  9994433777

In [32]:
df = df.drop_duplicates()
df

  username      mobile
0    user1   999999991
1    user1   888888882
2    user3   777777771
3    user2   777777234
4    user2   823232351
5    user5   734452343
6    user5   943433434
7    user5   834323434
9    user1  9994433777

In [36]:
df.groupby('username').size().reset_index(name='mobile_count')

  username  mobile_count
0    user1             3
1    user2             2
2    user3             1
3    user5             3